"""

Дан список my_list = [8, 6, 17, 52, 3, 9, 2, 63, 69], выведите все элементы, которые меньше 5.

"""



my_list = [8, 6, 1, 52, 3, 9, 2, 63, 69]
for x in my_list:
    if x < 5:
        print(x)